In [1]:
from basic_stats import *
import datetime
import warnings
warnings.filterwarnings('ignore')

In [2]:
date_from = '2022-01-01'
date_to = '2022-01-05'
# date_to = str(datetime.date.today())

In [3]:
# single_api_conv_request(advertiser=LIME_ADV_ID, date_from=date_from, date_to=date_to)

In [4]:
# lime_stats = get_conversions_dataframe(advertiser=LIME,  aff='29',  web='149714',  
#                                        date_from=date_from,  date_to=date_to)

In [5]:
ddt = get_dynamic_report(advertiser=LIME,  aff='29',  web='0', date_from=date_from,  date_to=date_to, index='date')
ddt

loan_category  reg  new  rep  costs_new  costs_rep  costs_total
date
2022-01-01     229   49   19     189500       9500       199000
2022-01-02     385   68   32     268000      16000       284000
2022-01-03     458   96   45     382000      22500       404500
2022-01-04     493  102   43     404800      21500       426300
2022-01-05     589  121   41     474300      20500       494800

In [6]:
ddt = get_dynamic_report(advertiser=LIME,  aff='29',  web='0', date_from=date_from,  date_to=date_to, index='week')
ddt

loan_category   reg  new  rep  costs_new  costs_rep  costs_total
week
1              1540  319  129    1261100      64500      1325600
52              614  117   51     457500      25500       483000

In [7]:
ddt = get_dynamic_report(advertiser=LIME,  aff='29',  web='0', date_from=date_from,  date_to=date_to, index='month')
ddt

loan_category   reg  new  rep  costs_new  costs_rep  costs_total
month
1              2154  436  180    1718600      90000      1808600